<?php
$MESS['API_MODULE_ID'] = 'artamonov.api';
$MESS['TITLE'] = 'Р‘РµР·РѕРїР°СЃРЅРѕСЃС‚СЊ';
$MESS['TAB_MAIN_TITLE'] = 'РћСЃРЅРѕРІРЅРѕРµ';
$MESS['TAB_FILTERS_TITLE'] = 'Р¤РёР»СЊС‚СЂС‹';
$MESS['TAB_AUTHORIZATION_TITLE'] = 'РђРІС‚РѕСЂРёР·Р°С†РёСЏ';

$MESS['OPTION_USE_ONLY_HTTPS_EXCHANGE_TITLE'] = 'РћР±РјРµРЅ С‚РѕР»СЊРєРѕ С‡РµСЂРµР· https-РїСЂРѕС‚РѕРєРѕР»';
$MESS['OPTION_ONLY_HTTPS_EXCHANGE_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ Р°РєС‚РёРІРµРЅ, С‚РѕРіРґР° РІСЃРµ Р·Р°РїСЂРѕСЃС‹, РєРѕС‚РѕСЂС‹Рµ РїСЂРёС…РѕРґСЏС‚ РЅР° API-РёРЅС‚РµСЂС„РµР№СЃ С‡РµСЂРµР· http-РїСЂРѕС‚РѕРєРѕР» - Р±СѓРґСѓС‚ РѕС‚РєР»РѕРЅРµРЅС‹.<br><br>Р’РЅРёРјР°РЅРёРµ: СЃР°Р№С‚ РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ РґРѕСЃС‚СѓРїРµРЅ РїРѕ Р°РґСЂРµСЃСѓ HTTPS://'.$_SERVER['SERVER_NAME'].'.<br><br>РџСЂРёРјРµС‡Р°РЅРёРµ: HTTPS РѕР±РµСЃРїРµС‡РёРІР°РµС‚ С€РёС„СЂРѕРІР°РЅРёРµ РґР°РЅРЅС‹С… РїСЂРё РёС… РїРµСЂРµРґР°С‡Рё.';

$MESS['OPTION_USE_AUTH_BY_LOGIN_PASSWORD'] = 'РђРІС‚РѕСЂРёР·Р°С†РёСЏ РїРѕ Р»РѕРіРёРЅСѓ Рё РїР°СЂРѕР»СЋ';
$MESS['OPTION_USE_AUTH_BY_LOGIN_PASSWORD_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ Р°РєС‚РёРІРµРЅ, С‚РѕРіРґР° РїСЂРё Р·Р°РїСЂРѕСЃРµ Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЊСЃСЏ РЅР°Р»РёС‡РёРµ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ РІ Р±Р°Р·Рµ РїРѕ СѓРєР°Р·Р°РЅРЅС‹Рј Р»РѕРіРёРЅСѓ Рё РїР°СЂРѕР»СЋ.<br><br>Р’РЅРёРјР°РЅРёРµ: РІР°Р¶РЅРѕ С‡С‚РѕР±С‹ РїСЂРё Р·Р°РїСЂРѕСЃРµ СЃРѕ СЃС‚РѕСЂРѕРЅС‹ РєР»РёРµРЅС‚Р° Р±С‹Р»Рё РѕС‚РїСЂР°РІР»РµРЅС‹ Р·Р°РіРѕР»РѕРІРєРё Authorization-Login Рё Authorization-Password.';

$MESS['OPTION_USE_AUTH_TOKEN_TITLE'] = 'РђРІС‚РѕСЂРёР·Р°С†РёСЏ РїРѕ С‚РѕРєРµРЅСѓ';
$MESS['OPTION_AUTH_TOKEN_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ Р°РєС‚РёРІРµРЅ, С‚РѕРіРґР° РїСЂРё Р·Р°РїСЂРѕСЃРµ Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЊСЃСЏ РЅР°Р»РёС‡РёРµ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ РІ Р±Р°Р·Рµ РїРѕ СѓРєР°Р·Р°РЅРЅРѕРјСѓ С‚РѕРєРµРЅСѓ.<br><br>Р’РЅРёРјР°РЅРёРµ:<br>1. РїРѕР»СЊР·РѕРІР°С‚РµР»СЋ Р±СѓРґРµС‚ РґРѕР±Р°РІР»РµРЅРѕ РїРѕР»СЊР·РѕРІР°С‚РµР»СЊСЃРєРѕРµ РїРѕР»Рµ #FIELD_NAME_RESTFUL_API_TOKEN#;<br>2. РІР°Р¶РЅРѕ С‡С‚РѕР±С‹ РїСЂРё Р·Р°РїСЂРѕСЃРµ СЃРѕ СЃС‚РѕСЂРѕРЅС‹ РєР»РёРµРЅС‚Р° Р±С‹Р» РѕС‚РїСЂР°РІР»РµРЅ Р·Р°РіРѕР»РѕРІРѕРє Authorization-Token СЃ С‚РѕРєРµРЅРѕРј (РєР»СЋС‡РµРІР°СЏ С„СЂР°Р·Р°<b>:</b>С‚РѕРєРµРЅ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ).';
$MESS['OPTION_TOKEN_KEYWORD_TITLE'] = 'РљР»СЋС‡РµРІР°СЏ С„СЂР°Р·Р°';
$MESS['OPTION_TOKEN_KEYWORD_HINT'] = 'РљР»СЋС‡РµРІР°СЏ С„СЂР°Р·Р° СЏРІР»СЏРµС‚СЃСЏ РґРѕРїРѕР»РЅРµРЅРёРµРј Рє С‚РѕРєРµРЅСѓ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ, С‚.Рµ. {Р¤СЂР°Р·Р°}<b>:</b>{РўРѕРєРµРЅ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ}.<br><br>РџСЂРёРјРµСЂ С‚РѕРєРµРЅР°: KEYWORD<b>:</b>d7804258-07dd-4216-84f5-3606168ec4d4.';
$MESS['TOKEN_GENERATE_TITLE'] = 'РЎРіРµРЅРµСЂРёСЂРѕРІР°С‚СЊ С‚РѕРєРµРЅС‹';
$MESS['TOKEN_GENERATE_HINT'] = 'Р•СЃР»Рё РІРєР»СЋС‡РµРЅР° Р°РІС‚РѕСЂРёР·Р°С†РёСЏ РїРѕ С‚РѕРєРµРЅСѓ, С‚РѕРіРґР° РїСЂРё РєР»РёРєРµ РЅР° СЃСЃС‹Р»РєСѓ Р±СѓРґСѓС‚ СЃРіРµРЅРµСЂРёСЂРѕРІР°РЅС‹ С‚РѕРєРµРЅС‹ РґР»СЏ С‚РµС… РїРѕР»СЊР·РѕРІР°С‚РµР»РµР№ Сѓ РєРѕРіРѕ РѕРЅРё РѕС‚СЃСѓС‚СЃС‚РІСѓСЋС‚.';
$MESS['GENERATE_LINK_TEXT'] = 'РЎРіРµРЅРµСЂРёСЂРѕРІР°С‚СЊ';

$MESS['OPTION_USE_CHECK_USER_GROUP'] = 'РџСЂРѕРІРµСЂСЏС‚СЊ РіСЂСѓРїРїСѓ';
$MESS['OPTION_USE_CHECK_USER_GROUP_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ Р°РєС‚РёРІРµРЅ, С‚РѕРіРґР° РїСЂРё Р·Р°РїСЂРѕСЃРµ Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЊСЃСЏ РїСЂРёРЅР°РґР»РµР¶РЅРѕСЃС‚СЊ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ Рє РіСЂСѓРїРїРµ.<br><br>Р’РЅРёРјР°РЅРёРµ: С„РёР»СЊС‚СЂ СЂР°Р±РѕС‚Р°РµС‚ С‚РѕР»СЊРєРѕ РїСЂРё Р°РєС‚РёРІР°С†РёРё РђРІС‚РѕСЂРёР·Р°С†РёРё РїРѕ Р»РѕРіРёРЅСѓ Рё РїР°СЂРѕР»СЋ Рё/РёР»Рё РђРІС‚РѕСЂРёР·Р°С†РёРё РїРѕ С‚РѕРєРµРЅСѓ.';
$MESS['OPTION_GROUP_LIST'] = 'РЎРїРёСЃРѕРє РіСЂСѓРїРї';

$MESS['OPTION_USE_WHITE_LIST_ADDRESS_FILTER'] = 'Р?СЃРїРѕР»СЊР·РѕРІР°С‚СЊ С„РёР»СЊС‚СЂ РїРѕ Р±РµР»С‹Рј IP-Р°РґСЂРµСЃР°Рј';
$MESS['OPTION_USE_WHITE_LIST_ADDRESS_FILTER_SELECT_TITLE_1'] = 'РћС‚РєР»СЋС‡РµРЅ';
$MESS['OPTION_USE_WHITE_LIST_ADDRESS_FILTER_SELECT_TITLE_2'] = 'Р’РєР»СЋС‡РµРЅ';
$MESS['OPTION_USE_WHITE_LIST_ADDRESS_FILTER_SELECT_ID_1'] = 'N';
$MESS['OPTION_USE_WHITE_LIST_ADDRESS_FILTER_SELECT_ID_2'] = 'Y';
$MESS['OPTION_USE_WHITE_LIST_ADDRESS_FILTER_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ РІРєР»СЋС‡С‘РЅ, С‚РѕРіРґР° РїСЂРё РѕР±СЂР°Р±РѕС‚РєРµ РІС…РѕРґСЏС‰РµРіРѕ Р·Р°РїСЂРѕСЃР° Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЊСЃСЏ РёСЃС‚РѕС‡РЅРёРє Р·Р°РїСЂРѕСЃР°.';
$MESS['OPTION_WHITE_LIST_ADDRESS_TITLE'] = 'РЎРїРёСЃРѕРє Р±РµР»С‹С… Р°РґСЂРµСЃРѕРІ';
$MESS['OPTION_WHITE_LIST_ADDRESS_HINT'] = 'РЎРїРёСЃРѕРє СЂР°Р·СЂРµС€РµРЅРЅС‹С… Р°РґСЂРµСЃРѕРІ, СЃ РєРѕС‚РѕСЂС‹С… API-РёРЅС‚РµСЂС„РµР№СЃ Р±СѓРґРµС‚ РѕР±СЂР°Р±Р°С‚С‹РІР°С‚СЊ РІС…РѕРґСЏС‰РёРµ Р·Р°РїСЂРѕСЃС‹.<br>РђРґСЂРµСЃР° РЅСѓР¶РЅРѕ РїРёСЃР°С‚СЊ С‡РµСЂРµР· С‚РѕС‡РєСѓ СЃ Р·Р°РїСЏС‚РѕР№.<br><br>РџСЂРёРјРµСЂ: 192.168.0.1; 192.168.0.2; 192.168.0.3';

$MESS['OPTION_USE_BLACK_LIST_ADDRESS_FILTER'] = 'Р?СЃРїРѕР»СЊР·РѕРІР°С‚СЊ С„РёР»СЊС‚СЂ РїРѕ С‡С‘СЂРЅС‹Рј IP-Р°РґСЂРµСЃР°Рј';
$MESS['OPTION_USE_BLACK_LIST_ADDRESS_FILTER_SELECT_TITLE_1'] = 'РћС‚РєР»СЋС‡РµРЅ';
$MESS['OPTION_USE_BLACK_LIST_ADDRESS_FILTER_SELECT_TITLE_2'] = 'Р’РєР»СЋС‡РµРЅ';
$MESS['OPTION_USE_BLACK_LIST_ADDRESS_FILTER_SELECT_ID_1'] = 'N';
$MESS['OPTION_USE_BLACK_LIST_ADDRESS_FILTER_SELECT_ID_2'] = 'Y';
$MESS['OPTION_USE_BLACK_LIST_ADDRESS_FILTER_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ РІРєР»СЋС‡С‘РЅ, С‚РѕРіРґР° РїСЂРё РѕР±СЂР°Р±РѕС‚РєРµ РІС…РѕРґСЏС‰РµРіРѕ Р·Р°РїСЂРѕСЃР° Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЊСЃСЏ РёСЃС‚РѕС‡РЅРёРє Р·Р°РїСЂРѕСЃР°.';
$MESS['OPTION_BLACK_LIST_ADDRESS_TITLE'] = 'РЎРїРёСЃРѕРє С‡С‘СЂРЅС‹С… Р°РґСЂРµСЃРѕРІ';
$MESS['OPTION_BLACK_LIST_ADDRESS_HINT'] = 'РЎРїРёСЃРѕРє Р·Р°РїСЂРµС‰РµРЅРЅС‹С… Р°РґСЂРµСЃРѕРІ, СЃ РєРѕС‚РѕСЂС‹С… API-РёРЅС‚РµСЂС„РµР№СЃ РќР• Р±СѓРґРµС‚ РѕР±СЂР°Р±Р°С‚С‹РІР°С‚СЊ РІС…РѕРґСЏС‰РёРµ Р·Р°РїСЂРѕСЃС‹.<br>РђРґСЂРµСЃР° РЅСѓР¶РЅРѕ РїРёСЃР°С‚СЊ С‡РµСЂРµР· С‚РѕС‡РєСѓ СЃ Р·Р°РїСЏС‚РѕР№.<br><br>РџСЂРёРјРµСЂ: 192.168.0.1; 192.168.0.2; 192.168.0.3';

$MESS['OPTION_USE_LIST_COUNTRY_FILTER'] = 'Р?СЃРїРѕР»СЊР·РѕРІР°С‚СЊ С„РёР»СЊС‚СЂ РїРѕ РєРѕРґСѓ СЃС‚СЂР°РЅС‹';
$MESS['OPTION_USE_LIST_COUNTRY_FILTER_SELECT_TITLE_1'] = 'РћС‚РєР»СЋС‡РµРЅ';
$MESS['OPTION_USE_LIST_COUNTRY_FILTER_SELECT_TITLE_2'] = 'Р’РєР»СЋС‡РµРЅ';
$MESS['OPTION_USE_LIST_COUNTRY_FILTER_SELECT_ID_1'] = 'N';
$MESS['OPTION_USE_LIST_COUNTRY_FILTER_SELECT_ID_2'] = 'Y';
$MESS['OPTION_USE_LIST_COUNTRY_FILTER_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ РІРєР»СЋС‡С‘РЅ, С‚РѕРіРґР° РїСЂРё РѕР±СЂР°Р±РѕС‚РєРµ РІС…РѕРґСЏС‰РµРіРѕ Р·Р°РїСЂРѕСЃР° Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЊСЃСЏ РєРѕРґ СЃС‚СЂР°РЅС‹ РёСЃС‚РѕС‡РЅРёРєР° Р·Р°РїСЂРѕСЃР°.';
$MESS['OPTION_WHITE_LIST_COUNTRY_TITLE'] = 'РЎРїРёСЃРѕРє РєРѕРґРѕРІ СЃС‚СЂР°РЅ';
$MESS['OPTION_WHITE_LIST_COUNTRY_HINT'] = 'РЎРїРёСЃРѕРє СЂР°Р·СЂРµС€РµРЅРЅС‹С… РєРѕРґРѕРІ СЃС‚СЂР°РЅ, СЃ РєРѕС‚РѕСЂС‹С… API-РёРЅС‚РµСЂС„РµР№СЃ Р±СѓРґРµС‚ РѕР±СЂР°Р±Р°С‚С‹РІР°С‚СЊ РІС…РѕРґСЏС‰РёРµ Р·Р°РїСЂРѕСЃС‹.<br>РљРѕРґС‹ РЅСѓР¶РЅРѕ РїРёСЃР°С‚СЊ С‡РµСЂРµР· С‚РѕС‡РєСѓ СЃ Р·Р°РїСЏС‚РѕР№.<br><br>РџСЂРёРјРµСЂ: RU; KZ; BY';

$MESS['OPTION_USE_ACCESS_CONTROL_ALLOW_ORIGIN_FILTER'] = 'РљСЂРѕСЃСЃ-РґРѕРјРµРЅРЅС‹Рµ Р·Р°РїСЂРѕСЃС‹';
$MESS['OPTION_USE_ACCESS_CONTROL_ALLOW_ORIGIN_FILTER_SELECT_TITLE_1'] = 'РћС‚РєР»СЋС‡РµРЅС‹';
$MESS['OPTION_USE_ACCESS_CONTROL_ALLOW_ORIGIN_FILTER_SELECT_TITLE_2'] = 'Р Р°Р·СЂРµС€РµРЅС‹';
$MESS['OPTION_USE_ACCESS_CONTROL_ALLOW_ORIGIN_FILTER_SELECT_ID_1'] = 'N';
$MESS['OPTION_USE_ACCESS_CONTROL_ALLOW_ORIGIN_FILTER_SELECT_ID_2'] = 'Y';
$MESS['OPTION_USE_ACCESS_CONTROL_ALLOW_ORIGIN_FILTER_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ РІРєР»СЋС‡С‘РЅ, С‚РѕРіРґР° РїСЂРё РѕР±СЂР°Р±РѕС‚РєРµ РІС…РѕРґСЏС‰РµРіРѕ Р·Р°РїСЂРѕСЃР° Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЊСЃСЏ РґРѕРјРµРЅ РёСЃС‚РѕС‡РЅРёРєР° Р·Р°РїСЂРѕСЃР°.';
$MESS['OPTION_WHITE_LIST_DOMAIN_ACCESS_CONTROL_ALLOW_ORIGIN_TITLE'] = 'РЎРїРёСЃРѕРє РґРѕРјРµРЅРѕРІ';
$MESS['OPTION_WHITE_LIST_DOMAIN_ACCESS_CONTROL_ALLOW_ORIGIN_HINT'] = 'РЎРїРёСЃРѕРє СЂР°Р·СЂРµС€РµРЅРЅС‹С… РґРѕРјРµРЅРѕРІ, СЃ РєРѕС‚РѕСЂС‹С… API-РёРЅС‚РµСЂС„РµР№СЃ Р±СѓРґРµС‚ РѕР±СЂР°Р±Р°С‚С‹РІР°С‚СЊ РІС…РѕРґСЏС‰РёРµ Р·Р°РїСЂРѕСЃС‹.<br>Р”РѕРјРµРЅС‹ РЅСѓР¶РЅРѕ РїРёСЃР°С‚СЊ С‡РµСЂРµР· С‚РѕС‡РєСѓ СЃ Р·Р°РїСЏС‚РѕР№.<br><br>РџСЂРёРјРµСЂ: http://site1.com; http://site2.com<br><br>РњРѕР¶РЅРѕ СѓРєР°Р·Р°С‚СЊ СЃРёРјРІРѕР» Р—РІС‘Р·РґРѕС‡РєР° (*), РІ СЌС‚РѕРј СЃР»СѓС‡Р°Рµ РёРЅС‚РµСЂС„РµР№СЃ Р±СѓРґРµС‚ РґРѕСЃС‚СѓРїРµРЅ РІСЃРµРј РґРѕРјРµРЅР°Рј.';

$MESS['TOKENS_GENERATED'] = 'РЎРіРµРЅРµСЂРёСЂРѕРІР°РЅРѕ С‚РѕРєРµРЅРѕРІ: #COUNT#';
$MESS['TOKENS_NOT_GENERATED'] = 'РўРѕРєРµРЅС‹ РЅРµ Р±С‹Р»Рё СЃРіРµРЅРµСЂРёСЂРѕРІР°РЅС‹';

$MESS['BTN_SAVE'] = 'РЎРѕС…СЂР°РЅРёС‚СЊ';
$MESS['BTN_RESTORE'] = 'РЎР±СЂРѕСЃРёС‚СЊ';
$MESS['OPTIONS_SAVED'] = 'РќР°СЃС‚СЂРѕР№РєРё СЃРѕС…СЂР°РЅРµРЅС‹';
$MESS['OPTIONS_RESTORED'] = 'РќР°СЃС‚СЂРѕР№РєРё СЃР±СЂРѕС€РµРЅС‹';