<?php
$MESS['TITLE'] = 'РќР°СЃС‚СЂРѕР№РєРё РјРѕРґСѓР»СЏ';
$MESS['TAB_MAIN_TITLE'] = 'РћСЃРЅРѕРІРЅРѕРµ';

$MESS['OPTION_USE_RESTFUL_API'] = 'Р?СЃРїРѕР»СЊР·РѕРІР°С‚СЊ RESTful API';
$MESS['OPTION_USE_RESTFUL_API_SELECT_TITLE_1'] = 'РћС‚РєР»СЋС‡РµРЅРѕ';
$MESS['OPTION_USE_RESTFUL_API_SELECT_TITLE_2'] = 'Р’РєР»СЋС‡РµРЅРѕ';
$MESS['OPTION_USE_RESTFUL_API_SELECT_ID_1'] = 'N';
$MESS['OPTION_USE_RESTFUL_API_SELECT_ID_2'] = 'Y';
$MESS['OPTION_USE_RESTFUL_API_SELECT_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ РІРєР»СЋС‡С‘РЅ, С‚РѕРіРґР° Р±СѓРґРµС‚ РІРѕР·РјРѕР¶РЅРѕСЃС‚СЊ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ RESTful API РЅР° СЃР°Р№С‚Рµ.';

$MESS['OPTION_PATH_RESTFUL_API'] = 'РџСѓС‚СЊ RESTful API';
$MESS['OPTION_PATH_RESTFUL_HINT'] = 'РџСѓС‚СЊ РїРѕ РєРѕС‚РѕСЂРѕРјСѓ Р±СѓРґРµС‚ РґРѕСЃС‚СѓРїРµРЅ РёРЅС‚РµСЂС„РµР№СЃ.<br><br>РџСЂРёРјРµСЂ: <b>/api/</b>';

$MESS['OPTION_USE_VERSIONS'] = 'Р?СЃРїРѕР»СЊР·РѕРІР°С‚СЊ РІРµСЂСЃРёРё';
$MESS['OPTION_USE_VERSIONS_SELECT_TITLE_1'] = 'РћС‚РєР»СЋС‡РµРЅРѕ';
$MESS['OPTION_USE_VERSIONS_SELECT_TITLE_2'] = 'Р’РєР»СЋС‡РµРЅРѕ';
$MESS['OPTION_USE_VERSIONS_SELECT_ID_1'] = 'N';
$MESS['OPTION_USE_VERSIONS_SELECT_ID_2'] = 'Y';
$MESS['OPTION_USE_VERSIONS_SELECT_HINT'] = 'Р•СЃР»Рё РїР°СЂР°РјРµС‚СЂ РІРєР»СЋС‡С‘РЅ, С‚РѕРіРґР° Р±СѓРґРµС‚ СѓС‡РёС‚С‹РІР°С‚СЊСЃСЏ РІРµСЂСЃРёСЏ РєРѕРЅС‚СЂРѕР»Р»РµСЂР° РѕР±СЂР°Р±Р°С‚С‹РІР°СЋС‰РµРіРѕ Р·Р°РїСЂРѕСЃ.<br><br>РќР°РїСЂРёРјРµСЂ: /api/<b>v1</b>/ - РІ СЌС‚РѕРј СЃР»СѓС‡Р°Рµ РёРЅС‚РµСЂС„РµР№СЃ Р±СѓРґРµС‚ РїРѕРґРєР»СЋС‡Р°С‚СЊ РєРѕРЅС‚СЂРѕР»Р»РµСЂ, РєРѕС‚РѕСЂС‹Р№ СЂР°СЃРїРѕР»Р°РіР°РµС‚СЃСЏ РїРѕ РїСѓС‚Рё: [РїР°РїРєР° РјРѕРґСѓР»СЏ]/lib/controllers/<b>v1</b>/[РЅР°Р·РІР°РЅРёРµ РєРѕРЅС‚СЂРѕР»Р»РµСЂР°].';

$MESS['OPTION_OPERATING_MODE'] = 'Р РµР¶РёРј СЂР°Р±РѕС‚С‹';
$MESS['OPTION_OPERATING_MODE_SELECT_TITLE_1'] = 'РћР±СЉРµРєС‚РЅРѕ-РѕСЂРёРµРЅС‚РёСЂРѕРІР°РЅРЅС‹Р№ (РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ)';
$MESS['OPTION_OPERATING_MODE_SELECT_TITLE_2'] = 'Р¤Р°Р№Р»РѕРІС‹Р№';
$MESS['OPTION_OPERATING_MODE_SELECT_TITLE_3'] = 'РћР±СЉРµРєС‚РЅРѕ-РѕСЂРёРµРЅС‚РёСЂРѕРІР°РЅРЅС‹Р№ + Р¤Р°Р№Р»РѕРІС‹Р№';
$MESS['OPTION_OPERATING_MODE_SELECT_ID_1'] = 'OBJECT_ORIENTED';
$MESS['OPTION_OPERATING_MODE_SELECT_ID_2'] = 'FILE';
$MESS['OPTION_OPERATING_MODE_SELECT_ID_3'] = 'OBJECT_ORIENTED_FILE';
$MESS['OPTION_OPERATING_MODE_HINT'] = 'РћР±СЉРµРєС‚РЅРѕ-РѕСЂРёРµРЅС‚РёСЂРѕРІР°РЅРЅС‹Р№ - Р·Р°РїСЂРѕСЃ Р±СѓРґРµС‚ РѕР±СЂР°Р±Р°С‚С‹РІР°С‚СЊСЃСЏ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‰РёРј РєРѕРЅС‚СЂРѕР»Р»РµСЂРѕРј (РѕР±СЉРµРєС‚РѕРј РєР»Р°СЃСЃР°) Рё РјРµС‚РѕРґРѕРј РєР»Р°СЃСЃР°, РєРѕС‚РѕСЂС‹Р№ СЂР°СЃРїРѕР»РѕРіР°РµС‚СЃСЏ РІ РїР°РїРєРµ РјРѕРґСѓР»СЏ (СЃРј. РґРѕРєСѓРјРµРЅС‚Р°С†РёСЋ).<br><br>Р¤Р°Р№Р»РѕРІС‹Р№ - Р·Р°РїСЂРѕСЃ Р±СѓРґРµС‚ РѕР±СЂР°Р±Р°С‚С‹РІР°С‚СЊСЃСЏ РєРѕРЅС‚СЂРѕР»Р»РµСЂРѕРј, РєРѕС‚РѕСЂС‹Р№ СЂР°СЃРїРѕР»Р°РіР°РµС‚СЃСЏ РїРѕ "РѕРґРЅРѕРёРјС‘РЅРЅРѕРјСѓ" С„РёР·РёС‡РµСЃРєРѕРјСѓ РїСѓС‚Рё (СЃРј. РґРѕРєСѓРјРµРЅС‚Р°С†РёСЋ).<br><br>РћР±СЉРµРєС‚РЅРѕ-РѕСЂРёРµРЅС‚РёСЂРѕРІР°РЅРЅС‹Р№ + Р¤Р°Р№Р»РѕРІС‹Р№ - РїСЂРё Р·Р°РїСЂРѕСЃРµ Р±СѓРґРµС‚ РїСЂРѕРёСЃС…РѕРґРёС‚СЊ РїРѕРёСЃРє РєРѕРЅС‚СЂРѕР»Р»РµСЂР° РІ РїР°РїРєРµ РјРѕРґСѓР»СЏ, РїСЂРё РЅРµСѓРґР°С‡РЅРѕР№ Р¶Рµ РїРѕРїС‹С‚РєРµ, РїРѕРёСЃРє Р±СѓРґРµС‚ РїСЂРѕРёСЃС…РѕРґРёС‚СЊ РїРѕ "РѕРґРЅРѕРёРјС‘РЅРЅРѕРјСѓ" С„РёР·РёС‡РµСЃРєРѕРјСѓ РїСѓС‚Рё (СЃРј. РґРѕРєСѓРјРµРЅС‚Р°С†РёСЋ).';

$MESS['BTN_SAVE'] = 'РЎРѕС…СЂР°РЅРёС‚СЊ';
$MESS['BTN_RESTORE'] = 'РЎР±СЂРѕСЃРёС‚СЊ';
$MESS['OPTIONS_SAVED'] = 'РќР°СЃС‚СЂРѕР№РєРё СЃРѕС…СЂР°РЅРµРЅС‹';
$MESS['OPTIONS_RESTORED'] = 'РќР°СЃС‚СЂРѕР№РєРё СЃР±СЂРѕС€РµРЅС‹';